package main

//
// Created by andy_ro@qq.com
// 			4/9/2019
//

//Game 游戏
type Game struct {
	ID     int32            //游戏类型
	Name   string           //游戏名称
	ByID   map[int32]string //房间列表
	ByName map[string]int32 //房间列表
}

//
func (s *Game) Exist(roomID int32) bool {
	_, ok := s.ByID[roomID]
	return ok
}

//Games 游戏列表
type Games struct {
	ByID   map[int32]Game  //游戏列表
	ByName map[string]Game //游戏列表
}

//
func (s *Games) Exist(gameID int32) (*Game, bool) {
	p, ok := s.ByID[gameID]
	return &p, ok
}

//
var GGames = Games{
	ByName: map[string]Game{
		"抢庄牛牛": Game{
			ID: 830,
			ByID: map[int32]string{
				8301: "体验房",
				8302: "初级房",
				8303: "中级房",
				8304: "高级房",
				8305: "至尊房",
				8306: "王者房",
			},
			ByName: map[string]int32{
				"体验房": 8301,
				"初级房": 8302,
				"中级房": 8303,
				"高级房": 8304,
				"至尊房": 8305,
				"王者房": 8306,
			},
		},
		"扎金花": Game{
			ID: 220,
			ByID: map[int32]string{
				2201: "体验房",
				2202: "初级房",
				2203: "中级房",
				2204: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 2201,
				"初级房": 2202,
				"中级房": 2203,
				"高级房": 2204,
			},
		},
		"21点": Game{
			ID: 600,
			ByID: map[int32]string{
				6001: "体验房",
				6002: "初级房",
				6003: "中级房",
				6004: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 6001,
				"初级房": 6002,
				"中级房": 6003,
				"高级房": 6004,
			},
		},
		//三公
		"三公": Game{
			ID: 860,
			ByID: map[int32]string{
				8601: "体验房",
				8602: "初级房",
				8603: "中级房",
				8604: "高级房",
				8605: "至尊房",
				8606: "王者房",
			},
			ByName: map[string]int32{
				"体验房": 8601,
				"初级房": 8602,
				"中级房": 8603,
				"高级房": 8604,
				"至尊房": 8605,
				"王者房": 8606,
			},
		},
		//二八杠
		"二八杠": Game{
			ID: 720,
			ByID: map[int32]string{
				7201: "体验房",
				7202: "初级房",
				7203: "中级房",
				7204: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 7201,
				"初级房": 7202,
				"中级房": 7203,
				"高级房": 7204,
			},
		},
		//压庄龙虎 - 龙虎斗
		"龙虎斗": Game{
			ID: 900,
			ByID: map[int32]string{
				9001: "体验房",
				9002: "初级房",
				9003: "中级房",
				9004: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 9001,
				"初级房": 9002,
				"中级房": 9003,
				"高级房": 9004,
			},
		},
		//百人牛牛
		"百人牛牛": Game{
			ID:   930,
			Name: "百人牛牛",
			ByID: map[int32]string{
				9301: "体验房",
				9302: "初级房",
				9303: "中级房",
				9304: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 9301,
				"初级房": 9302,
				"中级房": 9303,
				"高级房": 9304,
			},
		},
		//红黑大战
		"红黑大战": Game{
			ID: 210,
			ByID: map[int32]string{
				2101: "体验房",
				2102: "初级房",
				2103: "中级房",
				2104: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 2101,
				"初级房": 2102,
				"中级房": 2103,
				"高级房": 2104,
			},
		},
		//抢庄牌九
		"抢庄牌九": Game{
			ID: 300,
			ByID: map[int32]string{
				3001: "体验房",
				3002: "初级房",
				3003: "中级房",
				3004: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 3001,
				"初级房": 3002,
				"中级房": 3003,
				"高级房": 3004,
			},
		},
		//奔驰宝马
		"奔驰宝马": Game{
			ID: 1960,
			ByID: map[int32]string{
				19601: "体验房",
			},
			ByName: map[string]int32{
				"体验房": 19601,
			},
		},
	},
	ByID: map[int32]Game{
		//抢庄牛牛
		830: Game{
			Name: "抢庄牛牛",
			ByID: map[int32]string{
				8301: "体验房",
				8302: "初级房",
				8303: "中级房",
				8304: "高级房",
				8305: "至尊房",
				8306: "王者房",
			},
			ByName: map[string]int32{
				"体验房": 8301,
				"初级房": 8302,
				"中级房": 8303,
				"高级房": 8304,
				"至尊房": 8305,
				"王者房": 8306,
			},
		},
		//扎金花
		220: Game{
			Name: "扎金花",
			ByID: map[int32]string{
				2201: "体验房",
				2202: "初级房",
				2203: "中级房",
				2204: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 2201,
				"初级房": 2202,
				"中级房": 2203,
				"高级房": 2204,
			},
		},
		//21点
		600: Game{
			Name: "21点",
			ByID: map[int32]string{
				6001: "体验房",
				6002: "初级房",
				6003: "中级房",
				6004: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 6001,
				"初级房": 6002,
				"中级房": 6003,
				"高级房": 6004,
			},
		},
		//三公
		860: Game{
			Name: "三公",
			ByID: map[int32]string{
				8601: "体验房",
				8602: "初级房",
				8603: "中级房",
				8604: "高级房",
				8605: "至尊房",
				8606: "王者房",
			},
			ByName: map[string]int32{
				"体验房": 8601,
				"初级房": 8602,
				"中级房": 8603,
				"高级房": 8604,
				"至尊房": 8605,
				"王者房": 8606,
			},
		},
		//二八杠
		720: Game{
			Name: "二八杠",
			ByID: map[int32]string{
				7201: "体验房",
				7202: "初级房",
				7203: "中级房",
				7204: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 7201,
				"初级房": 7202,
				"中级房": 7203,
				"高级房": 7204,
			},
		},
		//压庄龙虎 - 龙虎斗
		900: Game{
			Name: "龙虎斗",
			ByID: map[int32]string{
				9001: "体验房",
				9002: "初级房",
				9003: "中级房",
				9004: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 9001,
				"初级房": 9002,
				"中级房": 9003,
				"高级房": 9004,
			},
		},
		//百人牛牛
		930: Game{
			Name: "百人牛牛",
			ByID: map[int32]string{
				9301: "体验房",
				9302: "初级房",
				9303: "中级房",
				9304: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 9301,
				"初级房": 9302,
				"中级房": 9303,
				"高级房": 9304,
			},
		},
		//红黑大战
		210: Game{
			Name: "红黑大战",
			ByID: map[int32]string{
				2101: "体验房",
				2102: "初级房",
				2103: "中级房",
				2104: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 2101,
				"初级房": 2102,
				"中级房": 2103,
				"高级房": 2104,
			},
		},
		//抢庄牌九
		300: Game{
			Name: "抢庄牌九",
			ByID: map[int32]string{
				3001: "体验房",
				3002: "初级房",
				3003: "中级房",
				3004: "高级房",
			},
			ByName: map[string]int32{
				"体验房": 3001,
				"初级房": 3002,
				"中级房": 3003,
				"高级房": 3004,
			},
		},
		//奔驰宝马
		1960: Game{
			Name: "奔驰宝马",
			ByID: map[int32]string{
				19601: "体验房",
			},
			ByName: map[string]int32{
				"体验房": 19601,
			},
		},
	},
}
